spec/fixtures/invoice_response.json

{"id":"1DAA0E24AF87493086AFA06248F81A0C",
   "due_date":"2016-07-19",
   "currency":"BRL",
   "discount_cents":0,
   "email":"person1@mesalva.com",
   "items_total_cents":1000,
   "notification_url":"nil",
   "return_url":"nil",
   "status":"paid",
   "tax_cents":"nil",
   "updated_at":"2016-07-19T11:14:58-03:00",
   "total_cents":1000,
   "total_paid_cents":1000,
   "paid_at":"2016-07-19T11:14:58-03:00",
   "taxes_paid_cents":57,
   "paid_cents":1000,
   "cc_emails":"nil",
   "financial_return_date":"nil",
   "payable_with":"all",
   "overpaid_cents":"nil",
   "ignore_due_email":"true",
   "ignore_canceled_email":"true",
   "advance_fee_cents":"nil",
   "secure_id":"1daa0e24-af87-4930-86af-a06248f81a0c-1c4c",
   "secure_url":"https://iugu.com/invoices/1daa0e24-af87-4930-86af-a06248f81a0c-1c4c",
   "customer_id":"C9D0A8F68F7F415A87CDC55EC11A7242",
   "customer_ref":"Me Salva!",
   "customer_name":"Me Salva!",
   "user_id":"nil",
   "total":"R$ 10,00",
   "taxes_paid":"R$ 0,57",
   "total_paid":"R$ 10,00",
   "total_overpaid":"R$ 0,00",
   "fines_on_occurrence_day":"R$ 0,00",
   "total_on_occurrence_day":"R$ 10,00",
   "fines_on_occurrence_day_cents":0,
   "total_on_occurrence_day_cents":1000,
   "advance_fee":"nil",
   "paid":"R$ 10,00",
   "interest":"nil",
   "discount":"nil",
   "created_at":"19/07, 11:14 h",
   "refundable":"true",
   "installments":"1",
   "transaction_number":1111,
   "payment_method":"iugu_credit_card_test",
   "created_at_iso":"2016-07-19T11:14:57-03:00",
   "updated_at_iso":"2016-07-19T11:14:58-03:00",
   "financial_return_dates":"nil",
   "bank_slip":"nil",
   "items":
    [{"id":"29BBE55C02294A2AB9CF80890C710575",
      "description":"Ativação de Assinatura: other package name",
      "price_cents":1000,
      "quantity":1,
      "created_at":"2016-07-19T11:14:57-03:00",
      "updated_at":"2016-07-19T11:14:57-03:00",
      "price":"R$ 10,00"}],
   "variables":
    [{"id":"DE2729BA50364A80919BF96DBC46EC82",
      "variable":"customer_payment_method_id",
      "value":"1F3599D777C047ADBFF8E88103903D35"},
     {"id":"921B11F1B19B421395183D82289A81F1", "variable":"dunning_day", "value":"0"},
     {"id":"8270CB9F25B84D2B9E93FE86D34F0FDB", "variable":"payment_data.arp", "value":"00000"},
     {"id":"DB35D37A4DA043B19910F8F17BDE58DD", "variable":"payment_data.installments", "value":"1"},
     {"id":"5DB46198901A4D7F89A9522F8042A617", "variable":"payment_data.nsu", "value":"00000"},
     {"id":"375C76E8D075457DAEC698FF7AE270F8", "variable":"payment_data.transaction_id", "value":"00000000000000000001"},
     {"id":"1DDA0E8B6025475BAB5CDB5088052885", "variable":"payment_data.transaction_number", "value":"1111"},
     {"id":"7E58F93700E043B6A2AA5B9CB2D801E6", "variable":"payment_method", "value":"iugu_credit_card_test"},
     {"id":"F1714533154042B386F1FB0C0DC1EA28", "variable":"subscription_id", "value":"7b725b3e-c4ba-4d6c-a9ec-58c5137253de"},
     {"id":"6C4EC6F7DB3B4CB292CD9A26D7F4D764", "variable":"update_subscription.expires_at", "value":"1471564800"},
     {"id":"4693F59421694DFE898E40B171FD1D27", "variable":"update_subscription.last_paid_amount_cents", "value":"1000"},
     {"id":"1DECBC847EED4FD2A5E9DF3FB782DFA0", "variable":"update_subscription.started_at", "value":"1468886400"},
     {"id":"87786A3E90E843648177109BB633849A", "variable":"update_subscription.suspended", "value":"0"}],
   "custom_variables":[],
   "logs":
    [{"id":"33FBF177030F4D56ACDAA8A8183F2CC1",
      "description":"Email de Recibo enviado!",
      "notes":"Recibo enviado com sucesso para: person1@mesalva.com",
      "created_at":"19/07, 11:14 h"},
     {"id":"5FDF58E43F164CAD8B621F5EC5B75C80",
      "description":"Fatura paga com sucesso!",
      "notes":"Fatura paga com Cartão de Crédito por:  LR: 00",
      "created_at":"19/07, 11:14 h"}]}
